app/controllers/comments_controller.rb

    def create
        @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("content", "user_id", "queen_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "mean comment"], ["user_id", 1], ["queen_id", 4], ["created_at", "2021-02-17 23:54:41.874687"], ["updated_at", "2021-02-17 23:54:41.874687"]]