app/controllers/contracts_controller.rb

    def index
        @contracts = Contract.all
---
SELECT "contracts".* FROM "contracts"

    def show
        @contract = Contract.find(params[:id])
---
SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]