app/controllers/queens_controller.rb

SELECT "queens".* FROM "queens"
---
    def index
        @queens = Queen.all

SELECT "queens".* FROM "queens" WHERE "queens"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def show
        @queen = Queen.find(params[:id])