app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @team = Team.find(params[:id])