app/controllers/users_controller.rb

    def create
        if User.find_by(username: params[:username])
            render json: {error: 'This user name already exists. Either login or enter another Username.'}
        else
            @user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hello"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "hello"], ["created_at", "2021-02-17 19:12:09.518283"], ["updated_at", "2021-02-17 19:12:09.518283"]]